app/views/favorites/_favorite.html.erb

<% if !Favorite.exists?(user_id: current_user.id, feedback_id: feedback.id) %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."feedback_id" = ? LIMIT ?  [["user_id", 1], ["feedback_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."feedback_id" = ? LIMIT ?  [["user_id", 1], ["feedback_id", 1], ["LIMIT", 1]]

  <% end %>
  <span class="star-count1"><%= feedback.favorites.count %></span>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."feedback_id" = ?  [["feedback_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."feedback_id" = ?  [["feedback_id", 1]]

  <% end %>
  <span class="star-count2"><%= feedback.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."feedback_id" = ?  [["feedback_id", 1]]