app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "feedback_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["feedback_id", 1], ["created_at", "2021-07-02 11:18:40.875292"], ["updated_at", "2021-07-02 11:18:40.875292"]]
---
  def create
    @favorite = Favorite.create(user_id: current_user.id, feedback_id: @feedback.id)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."feedback_id" = ? LIMIT ?  [["user_id", 2], ["feedback_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
    @favorite = Favorite.find_by(user_id: current_user.id, feedback_id: @feedback.id)
    @favorite.destroy

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_feedback
    @feedback = Feedback.find(params[:feedback_id])