app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
SELECT "favorites"."feedback_id" FROM "favorites" WHERE "favorites"."user_id" = ? ORDER BY "favorites"."created_at" DESC  [["user_id", 1]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        #トップ画面が表示された時に動作するアクション
        @feedbacks = Feedback.all
        favorites = Favorite.where(user_id: current_user.id).pluck(:feedback_id)
        @favorites = Feedback.find(favorites)

INSERT INTO "feedbacks" ("title", "assist", "user_id", "created_at", "updated_at", "action") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Webアプリの作成"], ["assist", "iiiii"], ["user_id", 1], ["created_at", "2021-07-02 07:37:47.528796"], ["updated_at", "2021-07-02 07:37:47.528796"], ["action", "aaaaa"]]
INSERT INTO "authors" ("user_id", "feedback_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["feedback_id", 2], ["created_at", "2021-07-02 07:37:47.555042"], ["updated_at", "2021-07-02 07:37:47.555042"]]
---
    def create
        #新しいフィードバックがフォームからPostされた時に動作するアクション
        feedback = Feedback.create(title:params["feedbacks"]["title"],assist:params["feedbacks"]["assist"],action:params["feedbacks"]["action"],user_id:params["feedbacks"]["user"])
        Author.create(feedback_id:feedback.id,user_id:current_user.id)

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 1]]
---
    def destroy
        feedback = Feedback.find(params["id"])
        feedback.destroy

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @feedback = Feedback.find(params["id"])

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "feedbacks" SET "user_id" = ?, "updated_at" = ? WHERE "feedbacks"."id" = ?  [["user_id", 1], ["updated_at", "2021-07-02 07:37:34.930925"], ["id", 1]]
---
    def update
        feedback = Feedback.find(params["id"])
        feedback.title = params["feedbacks"]["title"]
        feedback.assist = params["feedbacks"]["assist"]
        feedback.action = params["feedbacks"]["action"]
        feedback.user_id = params["feedbacks"]["user"]
        feedback.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."user_id" = ?  [["user_id", 1]]
---
    def show
        @user = User.find(params[:id])
        @feedbacks = Feedback.where(user_id:params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites"."feedback_id" FROM "favorites" WHERE "favorites"."user_id" = ? ORDER BY "favorites"."created_at" DESC  [["user_id", 1]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def favorite
        @user = User.find(params[:id])
        favorites = Favorite.where(user_id:current_user.id).order(created_at: :desc).pluck(:feedback_id)
        @feedbacks = Feedback.find(favorites)