app/controllers/missions_controller.rb

    def index
        @missions = Mission.all
---
SELECT "missions".* FROM "missions"

    def update
        mission = Mission.find_by(user_id: params["id"])
        mission.mission = params["body"]["content"]
        mission.user_id = current_user.id
        mission.save
        redirect_to "/missions"
        rescue => e
        mission = Mission.create(mission:params["body"]["content"],user_id:current_user.id)
---
SELECT "missions".* FROM "missions" WHERE "missions"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
UPDATE "missions" SET "mission" = ?, "updated_at" = ? WHERE "missions"."id" = ?  [["mission", "やったね"], ["updated_at", "2021-07-10 07:03:45.835566"], ["id", 1]]
INSERT INTO "missions" ("mission", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mission", "楽しく"], ["user_id", 1], ["created_at", "2021-07-10 07:03:38.938508"], ["updated_at", "2021-07-10 07:03:38.938508"]]